{"title:This is a compiled collection of god/recommended rolls from top community minds.\ndescription:Thanks to u/Mercules904, u/pandapaxxy, @AyyItsChevy, @chrisfried, u/-seudonym-, u/zman2100, Gleauxx, GodInGaming, Beenlab, CoolCheese, Critbuff, Apathettic, Ekuegan, Jarv, Ascendant Nomad, Shadow, Pijinnn, AbbyHour, GodinGaming, illPhysics, BRAVExHERO, Pattycakes, blueberries.gg, YeezyGT, and @johnldixon for their contributions. Ping u/48klocs / @48klocs with any issues.\n\ntitle:u/pandapaxxy's Vow of the Disciple Weapons, Season of the Risen Breakdown\ndescription:Originally found at https://www.reddit.com/r/sharditkeepit/comments/tfhd6k/vow_of_the_disciple_weapons_season_of_the_risen/\n\n// Deliverance\n//notes:pandapaxxy (PvE / M+KB / Controller): \"Deliverance is our first “kinetic” legendary fusion rifle. [...] Much like the rest of this season, you want to craft one with arrowhead brake to get that recoil direction up. Slotting just a counterbalance mod would suffice but you lose out on all the spec mods or backup mag. I think harmony or adrenaline junkie are going to be your best perks for general utility and major killing. But chill clip in conjunction with stasis builds will be really strong together.\". Recommended MW - Reload.|tags:pve,mkb,controller\ndimwishlist:item": null, " it falls just a little short compared to the zoom of Time-Worn Spire. Both are equally good options.\" Recommended MW: Range.|tags:pvp,mkb\ndimwishlist:item": null, " it falls just a little short compared to the zoom of Time-Worn Spire. Both are equally good options.\" Recommended MW: Stability.|tags:pvp,controller\ndimwishlist:item": null, " stats for all and one for all. Bumping up the lower stats all 150s have and boosting damage with the same activation. Other combos are the tried and true rapid hit paired with vorpal or explosive for decent damage but lower ceiling.\" Recommended MW: Reload.|tags:pve,mkb,controller\ndimwishlist:item": null, " ideally it would be snappy and have good stability to make my side easier in long range. You can fully send into handling and stability to offset the lower base stats, but you can’t go half way with it. Steady rounds on a scout rifle isn’t the worst idea because of the weapon types inherent range, so the loss of range really won’t hurt it either. Perpetual motion and either explosive payload or opening shot are the ideal perks to go really incentivise good crucible habits and make your shooting experience better, but if you don’t feel like moving around a lot you can opt for rapid hit instead to stay firmly planted at B flag.\" Recommended MW: Handling.|tags:pvp,mkb\ndimwishlist:item": null, " ideally it would be snappy and have good stability to make my side easier in long range. You can fully send into handling and stability to offset the lower base stats, but you can’t go half way with it. Steady rounds on a scout rifle isn’t the worst idea because of the weapon types inherent range, so the loss of range really won’t hurt it either. Perpetual motion and either explosive payload or opening shot are the ideal perks to go really incentivise good crucible habits and make your shooting experience better, but if you don’t feel like moving around a lot you can opt for rapid hit instead to stay firmly planted at B flag.\" Recommended MW: Stability.|tags:pvp,controller\ndimwishlist:item": null, " rivaling even Fatebringer. Ideally you’d want rapid hit and vorpal to cover your majors and minors, but timed payload is a great PvE perk similar to explosive payload. The delay in PvE is negligible and you get nothing but benefits. Rapid hit only works if the bullet portion hits crits but with the aim assist and PvE hit boxes you shouldn’t have a horrible time getting rapid hit going.\" Recommended MW: Reload.|tags:pve,mkb,controller\ndimwishlist:item": null, " a focused concentration of high damage": null, " or just a good feeling, decent damage weapon that you can take anywhere. There is no bad combo of perks for Funnelweb, just one’s that might not work for you.\" Recommended MW: Reload.|tags:pve,mkb,controller\ndimwishlist:item": null, "t many good options. The perk pool is limited to begin with and you’re better off using the heavy grenade launchers you already have.\" Recommended MW: Blast Radius.|tags:pvp,mkb,controller\ndimwishlist:item": null, " or you could breach and clear using subsistence and headstone to rip through groups of enemies": null, " if bosses are your bread and butter having more damage against them and ammo back through fourth time’s the charm can also leverage the high damage and magazine Herod-C can provide you.\". Recommended MW - Reload.|tags:pve,mkb,controller\ndimwishlist:item": null, " Col. 2: [Ricochet for stats, High-Cal/Armor Piercing for flinch], Col. 3: [Rangefinder for Zoom, Perpetual for constant buffs, Rapid Hit for ensuring you win the fights you start], Col 4: [Headstone for Stasis, Kill Clip for slaying in sixes, Moving Target for Aim Assist]. This is probably the easiest gun farm we've ever had, and for a great variable Hand Cannon that you can build to your preference. Give it a go.\" tags:god-pvp\ndimwishlist:item": null, " namely Rapid Hit/Outlaw with Kill Clip/Dragonfly/Vorpal. It unfortunately suffers from the same affliction other 150RPMs have from being merged into the 140RPM category - where they were previously Lightweights with low Range, but instrinsic Mobility buffs, they are now Adaptives, with lower Range than all other Adaptives, and no Mobility buff to make up for it.\" tags:pve\ndimwishlist:item": null, " Dragonfly/Explosive Payload/Rampage/Kill Clip. Almost every roll on this thing will put in work. It looks great too!\" tags:pve\ndimwishlist:item": null, " Snapshot for general use, Clown Cartridge/Triple Tap for extended damage. Explosive Payload should be your go-to here, with the exception of if you're running Triple Tap / using against Barrier champs, then you should look at Vorpal. Or if you simply don't like Explosive Payload, Vorpal's the play. Invest into a Handling barrel if you're not running Snapshot, and prioritise keeping the magazine high if you're running Triple Tap/Clown Cartridge.\" tags:god-pve\ndimwishlist:item": null, " Desperado or Kill Clip. Typically, you'll want (Rapid Hit/Outlaw with Desperado) or (Heating Up/Rapid Hit with Kill Clip). There's some strong options outside of this, but that's where you'll find the most success - personal preference plays a role here. I usually find more success with Kill Clip, as I prefer maintaining a uniform RPM.\" tags:god-pvp\ndimwishlist:item": null, " (Quickdraw, Threat Detector) and Auto-Loading Holster to be able to fire off a blinding grenade mid-fight. It shouldn't be overlooked as an Auto-Loading Spike Grenade GL either, if you're lacking one that can roll with a damage perk.\" tags:pve\ndimwishlist:item": null, " on an SMG as accurate as this, that makes Warmind Cells, that can be paired with some of the strongest Kinetic weapons in the game... It's nigh-on perfect. I actually recommend Alloy Mag here for the first time ever, simply because its noticeable when Threat Detector's no longer active, and you reach the bottom of the mag fast enough to feel that 33% reduced reload speed from Alloy.\" tags:god-pve\ndimwishlist:item": null, " as a staple utility weapon (Disruption Break / Elemental Capacitor) to be your CQC backup - or a close-range murder machine. Killing Wind with Swash/Kill Clip is incredibly strong, and Swashbuckler is easily brought to max damage with Sidearms, given their usual operating range. As a Burst sidearm, you can chain kills very easily once you're buffed.\" tags:pvp\ndimwishlist:item": null, " Auto-Loading Holster, Lasting Impression, and intrinsic Tracking. Outside of that, you have an incredible perk pool, boasting Clown Cartridge (Gjally's best DPS friend), Impulse Amplifier and Field Prep. It's heartbreakingly poor to farm for, however, as I'm roughly 2000 Strikes in since its introduction, with not really anything to show for it. Perhaps it becomes more accessible post-weapon crafting.\" tags:god-pve\ndimwishlist:item": null, " Overflow/Subsistence/Surplus, Frenzy/Rampage/Demolitionist, and its farmable via Moon quests. For controller, you'll want to invest more into Stability - this thing bounces around quite a bit.\" tags:pve\ndimwishlist:item": null, " triumphant, exuberant, or otherwise. You deserve to flex it. You're faultless. And so is your sword.\" tags:god-pve\ndimwishlist:item": null, " reloaders, along with stability and damage buffs. I typically like One-for-All over Rampage here, the buff longevity feels much better on a weaker weapon like a 180RPM, as Rampage becomes difficult to chain (within 3s) in mid-to-high level content. Similarly, Rapid Hit works a treat over Feeding Frenzy once you start dealing with more resistant enemies.\" tags:pve\ndimwishlist:item": null, " which is half of what video games are for, right?\" Recommended MW: Impact.|tags:mkb,pve\ndimwishlist:item": null, " which is half of what video games are for, right?\" Recommended MW: Impact.|tags:controller,pve\ndimwishlist:item": null, " [Quick/Hard Launch / Spike/Blinding / Surplush/Slideshot/Ambitious / Vorpal/Demolitionist/Frenzy]. Ultimately, this is a fantastic gun, and the rolls are mostly personal preference. There's a lot of fuss over Slideshot, but you may ultimately decide it doesn't fit your playstyle - my personal recommendation is Surplus, as it feels a lot better to get into the reload-shoot rhythm to me. Slideshot for PvP, however.\"|tags:god-pve,god-pvp\ndimwishlist:item": null, " [Stability / Reload / Subsistence/Overflow / Rampage/Frenzy]. For PvP, invest in": null, " [Surplus / Multikill Clip]. After IKELOS_SMG, this is likely the best 750RPM - and it definitely sounds like it. Subsistence is insanely strong on SMGs post-Primary changes, and Frenzy gives the perfect reload buff that SMGs direly need in PvE. In PvP, this is a strong contender, and up there as one of the best Legendary options, after Multimach in the same slot.\"|tags:god-pve,god-pvp\ndimwishlist:item": null, " [Hard Launch / Spike Grenades / Impulse Ampifier / Vorpal Weapon]. Its only drawback is the lack of an auto-loading option. If you're looking for an auto-reloader, Love and Death will be your best shot.|tags:god-pve\ndimwishlist:item": null, " Auto-Loading Holster, Lasting Impression, and inherent tracking. These days, that roll, or substituting LI for Demolitionist as a second auto-reloading option, is the only edge this Rocket holds over Ascendancy. If you're looking for a consistent Legendary damage option, with built-in tracking and no set-up required - here it is.|tags:god-pve\ndimwishlist:item": null, " pretty good PvE) - \"Honestly a weapon with great possibilities if the heavy weapon classes ever get reworked.\"\ndimwishlist:item": null, " curated)\n//notes:Mercules904 (pretty good PvE": null, " curated) - \"Honestly a weapon with great possibilities if the heavy weapon classes ever get reworked.\"\ndimwishlist:item": null}